hierarchy -auto-top
proc
flatten
opt
wreduce
opt
dffsr2dff
dff2dffe
pmux2shiftx
read_verilog -lib ../74_models.v
techmap -map ../74_adder.v -map ../74_dffe.v
synth -run :fine
opt -full
memory_map
opt -full
techmap -map +/techmap.v
opt
muxcover -mux4 -mux8
opt
techmap -map ../74_mux.v
dfflibmap -liberty ../74series.lib
abc -liberty ../74series.lib -D 100000
opt -full
